const adminUsername = '@mtwkarp';

const replyMessages = {
  schedule: {
    confirmedScheduleReply:
            'Дякую ! Вже надсилаю розклад пиздюку з евакуації.',
    scheduleMarkupDescription: 'Виберіть дні в які ви зможете викладати',
    scheduleAlreadyConfirmed:
            'Розклад вже надісланий, для його коригування використайте команду /schedule ще раз.',
    chosenScheduleMarkupNotActive:
            'Ця розкладка для запису у розклад вже не активна, пролистайте нижче і користуйтеся останньою.',
    scheduleClosed:
            'Наразі запис закритий. Запис стартує о 18:00 кожний четвер і закінчується в неділю о 17:00',
    scheduleMustBeFilledBeforeSending:
            'Виберіть в які дні можете викладати, або відмітьте свою недоступність перед відправкою. Наразі жодний з варіантів не вибраний.',
    userNotASMInstructor: `Наразі вас немає у списку ASM інструкторів. Повідомте про це ${adminUsername}.`,
    privateScheduleReminder: (surname) => `${surname}, нагадую тобі про запис у розклад 📆.\n`+'\nВикористай команду - /schedule.\n'+'\nДяка !❤',
    channelScheduleReminder: 'Всім добрий день !\n' +
        'Запис у графік на наступний тиждень вже відкритий, але тепер він проводиться за допомогою телеграм бота🤖. \n' +
        '\n' +
        'Заходимо і вводимо команду - ‘/schedule’.\n' +
        '\n' +
        'Посилання на бота - https://t.me/testkolesobot.\n' +
        '\n' +
        'Дякую !❤️\n',
    everyDayInstructorReminder: (baseName, instructorName) => {
      return `${instructorName}, добрий вечір !\n`+
      `\nНагадую, що завтра ти викладаєш на базі ${baseName}.\n`+
      '\nБажаю гарних курсантів  ❤️';
    }
  },
  start: {
    botIntroduction:
            'Вітаю у бета-версії бота для рутинних задач НТЦ “КОЛЕСО”.\n' +
            '\n' +
            'Опис доступних команд ви можете отримати за допомогою команди - /commandsinfo.\n' +
            '\n' +
            'Якщо у вас виникають будь-які труднощі або баги при використанні бота, то пишіть про них сюди - @mtwkarp.\n'
  },
  commands: {
    commandsDescription: '/commandsinfo - опис всіх команд боту.\n' +
        '\n' +
        '/schedule - команда для надсилання розкладу на наступний тиждень. Використання даної команди відбувається за графіком. Запис відкривається кожний четвер о 18:00 та закінчується кожну неділю о 17:00. \n' +
        '\n' +
        'Як користуватися.\n' +
        'Після виклику команди ви побачите кнопки з назвами днів тижня. Вам треба вибрати ті, в які ви можете викладати. Після того, як з’являться галочки на вибраних вами днях, треба натиснути кнопку “Підтвердити”. Не спішіть натискати кнопки з великою швидкістю, чекайте поки навпроти вами вибраного дня з’явиться галочка. Пропускна здатність телеграму чомусь не дозволяє надсилати запити від кнопок з великою швидкістю, це призводить до того, що декотрі запити зникають невідомо де (знайти причину цієї проблеми поки не можу).\n' +
        'У випадку якщо у вас змінився графік, але ви вже його надіслали, не біда. Все що треба зробити - це викликати ще раз дану команду. При повторному надсиланню розкладу, попередній анулюється. \n' +
        'При наявності специфічних коментарів з приводу свого графіка, пишіть сюди - @mtwkarp. Пізніше ця функціональність з’явиться в даному боті. Приклади коментарів: “Можу з другої половини дня”, “Не можу залишитися на симуляцію”.\n'
  }
};

module.exports = replyMessages;
